Ran Plan for 3 projects:

1. project: `apps-prod` dir: `4.apps` workspace: `prod`
1. project: `apps-staging` dir: `4.apps` workspace: `staging`
1. project: `platform` dir: `2.platform` workspace: `default`

### 1. project: `apps-prod` dir: `4.apps` workspace: `prod`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 workspace new prod" in "/atlantis-data/repos/wangzitian0/infra/272/prod/4.apps": exit status 1: ╷
│ Error: Required plugins are not installed
│ 
│ The installed provider plugins are not consistent with the packages
│ selected in the dependency lock file:
│   - registry.terraform.io/hashicorp/vault: the cached package for registry.terraform.io/hashicorp/vault 4.8.0 (in .terraform/providers) does not match any of the checksums recorded in the dependency lock file
│ 
│ Terraform uses external plugins to integrate with a variety of different
│ infrastructure services. You must install the required plugins before
│ running Terraform operations.
╵


infra-flash-commit:5be2097 

Backend config changed or missing. Reinitializing...

```
</details>

---
### 2. project: `apps-staging` dir: `4.apps` workspace: `staging`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 plan -input=false -refresh -out \"/atlantis-data/repos/wangzitian0/infra/272/staging/4.apps/apps-staging-staging.tfplan\"" in "/atlantis-data/repos/wangzitian0/infra/272/staging/4.apps": exit status 1
infra-flash-commit:5be2097 

Backend config changed or missing. Reinitializing...

terraform_data.domain_config_check: Refreshing state... [id=76752d53-0901-ad4c-2111-13596e49c371]
data.vault_kv_secret_v2.kubero: Reading...
random_id.kubero_session_secret: Refreshing state... [id=e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw]
random_id.kubero_webhook_secret: Refreshing state... [id=9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8]
kubernetes_namespace.kubero_operator_system: Refreshing state... [id=kubero-operator-system-staging]
kubectl_manifest.kubero_operator[48]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/services/kubero-operator-controller-manager-metrics-service]
kubectl_manifest.kubero_operator[27]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-editor-role]
kubectl_manifest.kubero_operator[1]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[37]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-viewer-role]
kubectl_manifest.kubero_operator[16]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopipelines.application.kubero.dev]
kubectl_manifest.kubero_operator[46]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-proxy-rolebinding]
kubectl_manifest.kubero_operator[42]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-metrics-reader]
kubectl_manifest.kubero_operator[39]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-editor-role]
kubectl_manifest.kubero_operator[17]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberopostgresqls.application.kubero.dev]
kubectl_manifest.kubero_operator[14]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomongodbs.application.kubero.dev]
kubectl_manifest.kubero_operator[34]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-viewer-role]
kubectl_manifest.kubero_operator[19]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberorabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[12]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomails.application.kubero.dev]
kubectl_manifest.kubero_operator[29]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-admin-role]
kubectl_manifest.kubero_operator[11]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberokafkas.application.kubero.dev]
kubectl_manifest.kubero_operator[5]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonredis.application.kubero.dev]
kubectl_manifest.kubero_operator[26]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-admin-role]
kubectl_manifest.kubero_operator[2]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[40]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-viewer-role]
kubectl_manifest.kubero_operator[4]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonrabbitmqs.application.kubero.dev]
kubectl_manifest.kubero_operator[23]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-admin-role]
kubectl_manifest.kubero_operator[38]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonredis-admin-role]
kubectl_manifest.kubero_operator[13]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[33]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-editor-role]
kubectl_manifest.kubero_operator[22]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system-staging/roles/kubero-operator-leader-election-role]
kubectl_manifest.kubero_operator[7]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberobuilds.application.kubero.dev]
kubectl_manifest.kubero_operator[32]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonpostgres-admin-role]
kubectl_manifest.kubero_operator[0]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonmemcacheds.application.kubero.dev]
kubectl_manifest.kubero_operator[43]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-proxy-role]
kubectl_manifest.kubero_operator[30]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-editor-role]
kubectl_manifest.kubero_operator[10]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoes.application.kubero.dev]
kubectl_manifest.kubero_operator[9]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoelasticsearches.application.kubero.dev]
kubectl_manifest.kubero_operator[47]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/configmaps/kubero-operator-manager-config]
kubectl_manifest.kubero_operator[25]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-viewer-role]
kubectl_manifest.kubero_operator[44]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/namespaces/kubero-operator-system-staging/rolebindings/kubero-operator-leader-election-rolebinding]
kubectl_manifest.kubero_operator[35]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-admin-role]
kubectl_manifest.kubero_operator[45]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterrolebindings/kubero-operator-manager-rolebinding]
kubectl_manifest.kubero_operator[21]: Refreshing state... [id=/api/v1/namespaces/kubero-operator-system-staging/serviceaccounts/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[20]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoredis.application.kubero.dev]
kubectl_manifest.kubero_operator[8]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberocouchdbs.application.kubero.dev]
kubectl_manifest.kubero_operator[49]: Refreshing state... [id=/apis/apps/v1/namespaces/kubero-operator-system-staging/deployments/kubero-operator-controller-manager]
kubectl_manifest.kubero_operator[15]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberomysqls.application.kubero.dev]
kubectl_manifest.kubero_operator[28]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmongodb-viewer-role]
kubectl_manifest.kubero_operator[6]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoapps.application.kubero.dev]
kubectl_manifest.kubero_operator[31]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmysql-viewer-role]
kubectl_manifest.kubero_operator[24]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonmemcached-editor-role]
kubectl_manifest.kubero_operator[18]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoprometheuses.application.kubero.dev]
kubectl_manifest.kubero_operator[36]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-kuberoaddonrabbitmq-editor-role]
kubectl_manifest.kubero_operator[3]: Refreshing state... [id=/apis/apiextensions.k8s.io/v1/customresourcedefinitions/kuberoaddonpostgres.application.kubero.dev]
kubectl_manifest.kubero_operator[41]: Refreshing state... [id=/apis/rbac.authorization.k8s.io/v1/clusterroles/kubero-operator-manager-role]
kubernetes_namespace.kubero: Refreshing state... [id=kubero-staging]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform planned the following actions, but then encountered a problem:

  # kubernetes_service_account.kubero will be created
  + resource "kubernetes_service_account" "kubero" {
      + automount_service_account_token = true
      + default_secret_name             = (known after apply)
      + id                              = (known after apply)

      + metadata {
          + generation       = (known after apply)
          + name             = "kubero"
          + namespace        = "kubero-staging"
          + resource_version = (known after apply)
          + uid              = (known after apply)
        }
    }

  # random_id.kubero_session_secret will be destroyed
  # (because random_id.kubero_session_secret is not in configuration)
  - resource "random_id" "kubero_session_secret" {
      - b64_std     = "e58531z2HdrLNZ9i+1GmJGKefa9im2GzUR1u8LRDTvw=" -> null
      - b64_url     = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
      - byte_length = 32 -> null
      - dec         = "55915808480441380053427832712491152012099215374657984171750255703449988714236" -> null
      - hex         = "7b9f39df5cf61ddacb359f62fb51a624629e7daf629b61b3511d6ef0b4434efc" -> null
      - id          = "e58531z2HdrLNZ9i-1GmJGKefa9im2GzUR1u8LRDTvw" -> null
    }

  # random_id.kubero_webhook_secret will be destroyed
  # (because random_id.kubero_webhook_secret is not in configuration)
  - resource "random_id" "kubero_webhook_secret" {
      - b64_std     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ+a0CX0Fv3vjK8+p8=" -> null
      - b64_url     = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
      - byte_length = 32 -> null
      - dec         = "111612930202753751380578856482081899563019285496294477810649772987267428448927" -> null
      - hex         = "f6c2ae080b0219280d73daf6cb4360f5f1db58467e6b4097d05bf7be32bcfa9f" -> null
      - id          = "9sKuCAsCGSgNc9r2y0Ng9fHbWEZ-a0CX0Fv3vjK8-p8" -> null
    }

Plan: 1 to add, 0 to change, 2 to destroy.
╷
│ Error: no secret found at "secret/data/data/kubero"
│ 
│   with data.vault_kv_secret_v2.kubero,
│   on 1.kubero.tf line 104, in data "vault_kv_secret_v2" "kubero":
│  104: data "vault_kv_secret_v2" "kubero" {
│ 
╵


```
</details>

---
### 3. project: `platform` dir: `2.platform` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "/atlantis-data/bin/terraform1.6.6 plan -input=false -refresh -out \"/atlantis-data/repos/wangzitian0/infra/272/default/2.platform/platform-default.tfplan\"" in "/atlantis-data/repos/wangzitian0/infra/272/default/2.platform": exit status 1
infra-flash-commit:5be2097 

Backend config changed or missing. Reinitializing...

random_bytes.l3_arangodb_jwt: Refreshing state...
random_password.l3_clickhouse: Refreshing state... [id=none]
random_password.l3_redis: Refreshing state... [id=none]
random_password.l3_postgres: Refreshing state... [id=none]
random_password.l3_arangodb: Refreshing state... [id=none]
terraform_data.portal_sso_precheck: Refreshing state... [id=a912d9c3-6b86-ef7f-b2b4-f4e56f422964]
vault_mount.database: Refreshing state... [id=database]
vault_policy.default: Refreshing state... [id=default]
vault_mount.kv: Refreshing state... [id=secret]
data.kubernetes_namespace.platform: Reading...
data.cloudflare_zone.internal: Reading...
data.kubernetes_namespace.platform: Read complete after 0s [id=platform]
kubernetes_service_account.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
kubernetes_config_map.casdoor_init_data[0]: Refreshing state... [id=platform/casdoor-init-data]
data.kubernetes_secret.casdoor_builtin: Reading...
helm_release.kubernetes_dashboard: Refreshing state... [id=kubernetes-dashboard]
helm_release.vault: Refreshing state... [id=vault]
data.kubernetes_secret.casdoor_builtin: Read complete after 0s [id=platform/casdoor-builtin-secret]
vault_kv_secret_v2.l3_redis: Refreshing state... [id=secret/data/data/redis]
vault_kv_secret_v2.l3_postgres: Refreshing state... [id=secret/data/data/postgres]
vault_kv_secret_v2.l3_arangodb: Refreshing state... [id=secret/data/data/arangodb]
vault_kv_secret_v2.l3_clickhouse: Refreshing state... [id=secret/data/data/clickhouse]
helm_release.casdoor[0]: Refreshing state... [id=casdoor]
kubernetes_cluster_role_binding.dashboard_api_admin: Refreshing state... [id=kubernetes-dashboard-api-admin]
kubernetes_service_account.dashboard_admin: Refreshing state... [id=platform/dashboard-admin]
kubernetes_ingress_v1.dashboard: Refreshing state... [id=platform/kubernetes-dashboard]
kubernetes_secret.dashboard_admin_token: Refreshing state... [id=platform/dashboard-admin-token]
kubernetes_cluster_role_binding.dashboard_admin: Refreshing state... [id=dashboard-admin]
kubernetes_ingress_v1.vault: Refreshing state... [id=platform/vault-ingress]
data.cloudflare_zone.internal: Read complete after 1s [id=6e69310ba4000e47c0a2480e2606713a]
restapi_object.provider_github[0]: Preparing import... [id=admin/GitHub]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.http.portal_auth_ping[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "portal_auth_ping" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://auth.zitian.party/ping"
    }

  # helm_release.portal_auth[0] will be created
  + resource "helm_release" "portal_auth" {
      + atomic                     = false
      + chart                      = "oauth2-proxy"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "portal-auth"
      + namespace                  = "platform"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://oauth2-proxy.github.io/manifests"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = (known after apply)
      + verify                     = false
      + version                    = "7.12.7"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # kubernetes_ingress_v1.dashboard will be updated in-place
  ~ resource "kubernetes_ingress_v1" "dashboard" {
        id     = "platform/kubernetes-dashboard"
        # (1 unchanged attribute hidden)

      ~ metadata {
          ~ annotations      = {
              + "traefik.ingress.kubernetes.io/router.middlewares"    = "platform-portal-auth@kubernetescrd"
                # (3 unchanged elements hidden)
            }
            name             = "kubernetes-dashboard"
            # (5 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # kubernetes_manifest.portal_auth_middleware_platform[0] will be created
  + resource "kubernetes_manifest" "portal_auth_middleware_platform" {
      + manifest = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + name      = "portal-auth"
              + namespace = "platform"
            }
          + spec       = {
              + forwardAuth = {
                  + address             = "http://portal-auth-oauth2-proxy.platform.svc.cluster.local/"
                  + authResponseHeaders = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + trustForwardHeader  = false
                }
            }
        }
      + object   = {
          + apiVersion = "traefik.io/v1alpha1"
          + kind       = "Middleware"
          + metadata   = {
              + annotations                = (known after apply)
              + creationTimestamp          = (known after apply)
              + deletionGracePeriodSeconds = (known after apply)
              + deletionTimestamp          = (known after apply)
              + finalizers                 = (known after apply)
              + generateName               = (known after apply)
              + generation                 = (known after apply)
              + labels                     = (known after apply)
              + managedFields              = (known after apply)
              + name                       = "portal-auth"
              + namespace                  = "platform"
              + ownerReferences            = (known after apply)
              + resourceVersion            = (known after apply)
              + selfLink                   = (known after apply)
              + uid                        = (known after apply)
            }
          + spec       = {
              + addPrefix         = {
                  + prefix = (known after apply)
                }
              + basicAuth         = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + buffering         = {
                  + maxRequestBodyBytes  = (known after apply)
                  + maxResponseBodyBytes = (known after apply)
                  + memRequestBodyBytes  = (known after apply)
                  + memResponseBodyBytes = (known after apply)
                  + retryExpression      = (known after apply)
                }
              + chain             = {
                  + middlewares = (known after apply)
                }
              + circuitBreaker    = {
                  + checkPeriod      = (known after apply)
                  + expression       = (known after apply)
                  + fallbackDuration = (known after apply)
                  + recoveryDuration = (known after apply)
                  + responseCode     = (known after apply)
                }
              + compress          = {
                  + defaultEncoding      = (known after apply)
                  + encodings            = (known after apply)
                  + excludedContentTypes = (known after apply)
                  + includedContentTypes = (known after apply)
                  + minResponseBodyBytes = (known after apply)
                }
              + contentType       = {
                  + autoDetect = (known after apply)
                }
              + digestAuth        = {
                  + headerField  = (known after apply)
                  + realm        = (known after apply)
                  + removeHeader = (known after apply)
                  + secret       = (known after apply)
                }
              + errors            = {
                  + query          = (known after apply)
                  + service        = {
                      + healthCheck        = {
                          + followRedirects   = (known after apply)
                          + headers           = (known after apply)
                          + hostname          = (known after apply)
                          + interval          = (known after apply)
                          + method            = (known after apply)
                          + mode              = (known after apply)
                          + path              = (known after apply)
                          + port              = (known after apply)
                          + scheme            = (known after apply)
                          + status            = (known after apply)
                          + timeout           = (known after apply)
                          + unhealthyInterval = (known after apply)
                        }
                      + kind               = (known after apply)
                      + name               = (known after apply)
                      + namespace          = (known after apply)
                      + nativeLB           = (known after apply)
                      + nodePortLB         = (known after apply)
                      + passHostHeader     = (known after apply)
                      + port               = (known after apply)
                      + responseForwarding = {
                          + flushInterval = (known after apply)
                        }
                      + scheme             = (known after apply)
                      + serversTransport   = (known after apply)
                      + sticky             = {
                          + cookie = {
                              + domain   = (known after apply)
                              + httpOnly = (known after apply)
                              + maxAge   = (known after apply)
                              + name     = (known after apply)
                              + path     = (known after apply)
                              + sameSite = (known after apply)
                              + secure   = (known after apply)
                            }
                        }
                      + strategy           = (known after apply)
                      + weight             = (known after apply)
                    }
                  + status         = (known after apply)
                  + statusRewrites = (known after apply)
                }
              + forwardAuth       = {
                  + addAuthCookiesToResponse = (known after apply)
                  + address                  = "http://portal-auth-oauth2-proxy.platform.svc.cluster.local/"
                  + authRequestHeaders       = (known after apply)
                  + authResponseHeaders      = [
                      + "X-Auth-Request-User",
                      + "X-Auth-Request-Email",
                    ]
                  + authResponseHeadersRegex = (known after apply)
                  + forwardBody              = (known after apply)
                  + headerField              = (known after apply)
                  + maxBodySize              = (known after apply)
                  + preserveLocationHeader   = (known after apply)
                  + preserveRequestMethod    = (known after apply)
                  + tls                      = {
                      + caOptional         = (known after apply)
                      + caSecret           = (known after apply)
                      + certSecret         = (known after apply)
                      + insecureSkipVerify = (known after apply)
                    }
                  + trustForwardHeader       = false
                }
              + grpcWeb           = {
                  + allowOrigins = (known after apply)
                }
              + headers           = {
                  + accessControlAllowCredentials     = (known after apply)
                  + accessControlAllowHeaders         = (known after apply)
                  + accessControlAllowMethods         = (known after apply)
                  + accessControlAllowOriginList      = (known after apply)
                  + accessControlAllowOriginListRegex = (known after apply)
                  + accessControlExposeHeaders        = (known after apply)
                  + accessControlMaxAge               = (known after apply)
                  + addVaryHeader                     = (known after apply)
                  + allowedHosts                      = (known after apply)
                  + browserXssFilter                  = (known after apply)
                  + contentSecurityPolicy             = (known after apply)
                  + contentSecurityPolicyReportOnly   = (known after apply)
                  + contentTypeNosniff                = (known after apply)
                  + customBrowserXSSValue             = (known after apply)
                  + customFrameOptionsValue           = (known after apply)
                  + customRequestHeaders              = (known after apply)
                  + customResponseHeaders             = (known after apply)
                  + featurePolicy                     = (known after apply)
                  + forceSTSHeader                    = (known after apply)
                  + frameDeny                         = (known after apply)
                  + hostsProxyHeaders                 = (known after apply)
                  + isDevelopment                     = (known after apply)
                  + permissionsPolicy                 = (known after apply)
                  + publicKey                         = (known after apply)
                  + referrerPolicy                    = (known after apply)
                  + sslForceHost                      = (known after apply)
                  + sslHost                           = (known after apply)
                  + sslProxyHeaders                   = (known after apply)
                  + sslRedirect                       = (known after apply)
                  + sslTemporaryRedirect              = (known after apply)
                  + stsIncludeSubdomains              = (known after apply)
                  + stsPreload                        = (known after apply)
                  + stsSeconds                        = (known after apply)
                }
              + inFlightReq       = {
                  + amount          = (known after apply)
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + ipAllowList       = {
                  + ipStrategy       = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + rejectStatusCode = (known after apply)
                  + sourceRange      = (known after apply)
                }
              + ipWhiteList       = {
                  + ipStrategy  = {
                      + depth       = (known after apply)
                      + excludedIPs = (known after apply)
                      + ipv6Subnet  = (known after apply)
                    }
                  + sourceRange = (known after apply)
                }
              + passTLSClientCert = {
                  + info = {
                      + issuer       = {
                          + commonName      = (known after apply)
                          + country         = (known after apply)
                          + domainComponent = (known after apply)
                          + locality        = (known after apply)
                          + organization    = (known after apply)
                          + province        = (known after apply)
                          + serialNumber    = (known after apply)
                        }
                      + notAfter     = (known after apply)
                      + notBefore    = (known after apply)
                      + sans         = (known after apply)
                      + serialNumber = (known after apply)
                      + subject      = {
                          + commonName         = (known after apply)
                          + country            = (known after apply)
                          + domainComponent    = (known after apply)
                          + locality           = (known after apply)
                          + organization       = (known after apply)
                          + organizationalUnit = (known after apply)
                          + province           = (known after apply)
                          + serialNumber       = (known after apply)
                        }
                    }
                  + pem  = (known after apply)
                }
              + plugin            = (known after apply)
              + rateLimit         = {
                  + average         = (known after apply)
                  + burst           = (known after apply)
                  + period          = (known after apply)
                  + redis           = {
                      + db             = (known after apply)
                      + dialTimeout    = (known after apply)
                      + endpoints      = (known after apply)
                      + maxActiveConns = (known after apply)
                      + minIdleConns   = (known after apply)
                      + poolSize       = (known after apply)
                      + readTimeout    = (known after apply)
                      + secret         = (known after apply)
                      + tls            = {
                          + caSecret           = (known after apply)
                          + certSecret         = (known after apply)
                          + insecureSkipVerify = (known after apply)
                        }
                      + writeTimeout   = (known after apply)
                    }
                  + sourceCriterion = {
                      + ipStrategy        = {
                          + depth       = (known after apply)
                          + excludedIPs = (known after apply)
                          + ipv6Subnet  = (known after apply)
                        }
                      + requestHeaderName = (known after apply)
                      + requestHost       = (known after apply)
                    }
                }
              + redirectRegex     = {
                  + permanent   = (known after apply)
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + redirectScheme    = {
                  + permanent = (known after apply)
                  + port      = (known after apply)
                  + scheme    = (known after apply)
                }
              + replacePath       = {
                  + path = (known after apply)
                }
              + replacePathRegex  = {
                  + regex       = (known after apply)
                  + replacement = (known after apply)
                }
              + retry             = {
                  + attempts        = (known after apply)
                  + initialInterval = (known after apply)
                }
              + stripPrefix       = {
                  + forceSlash = (known after apply)
                  + prefixes   = (known after apply)
                }
              + stripPrefixRegex  = {
                  + regex = (known after apply)
                }
            }
        }
    }

  # random_id.kubero_session_secret will be created
  + resource "random_id" "kubero_session_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_id.kubero_webhook_secret will be created
  + resource "random_id" "kubero_webhook_secret" {
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 32
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
    }

  # random_password.dashboard_oidc_client_secret[0] will be created
  + resource "random_password" "dashboard_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.kubero_oidc_client_secret[0] will be created
  + resource "random_password" "kubero_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.portal_cookie_secret[0] will be created
  + resource "random_password" "portal_cookie_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.portal_gate_client_secret[0] will be created
  + resource "random_password" "portal_gate_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # random_password.vault_oidc_client_secret[0] will be created
  + resource "random_password" "vault_oidc_client_secret" {
      + bcrypt_hash = (sensitive value)
      + id          = (known after apply)
      + length      = 32
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (sensitive value)
      + special     = false
      + upper       = true
    }

  # terraform_data.portal_sso_precheck will be updated in-place
  ~ resource "terraform_data" "portal_sso_precheck" {
        id     = "a912d9c3-6b86-ef7f-b2b4-f4e56f422964"
      ~ input  = {
          ~ enabled = false -> true
        }
      ~ output = {
          - enabled = false
        } -> (known after apply)
    }

  # vault_auth_backend.kubernetes will be created
  + resource "vault_auth_backend" "kubernetes" {
      + accessor        = (known after apply)
      + disable_remount = false
      + id              = (known after apply)
      + path            = "kubernetes"
      + tune            = (known after apply)
      + type            = "kubernetes"
    }

  # vault_kubernetes_auth_backend_config.config will be created
  + resource "vault_kubernetes_auth_backend_config" "config" {
      + backend                           = "kubernetes"
      + disable_iss_validation            = true
      + disable_local_ca_jwt              = (known after apply)
      + id                                = (known after apply)
      + kubernetes_ca_cert                = (known after apply)
      + kubernetes_host                   = "https://kubernetes.default.svc"
      + use_annotations_as_alias_metadata = (known after apply)
    }

  # vault_kubernetes_auth_backend_role.kubero will be created
  + resource "vault_kubernetes_auth_backend_role" "kubero" {
      + alias_name_source                = (known after apply)
      + backend                          = "kubernetes"
      + bound_service_account_names      = [
          + "kubero",
        ]
      + bound_service_account_namespaces = [
          + "kubero-*",
        ]
      + id                               = (known after apply)
      + role_name                        = "kubero"
      + token_policies                   = [
          + "kubero",
        ]
      + token_ttl                        = 3600
      + token_type                       = "default"
    }

  # vault_kv_secret_v2.kubero will be created
  + resource "vault_kv_secret_v2" "kubero" {
      + data                = (sensitive value)
      + data_json           = (sensitive value)
      + delete_all_versions = true
      + disable_read        = false
      + id                  = (known after apply)
      + metadata            = (known after apply)
      + mount               = "secret"
      + name                = "data/kubero"
      + path                = (known after apply)
    }

  # vault_policy.kubero will be created
  + resource "vault_policy" "kubero" {
      + id     = (known after apply)
      + name   = "kubero"
      + policy = <<-EOT
            path "secret/data/data/kubero" {
              capabilities = ["read"]
            }
        EOT
    }

  # vault_policy.reader[0] will be created
  + resource "vault_policy" "reader" {
      + id     = (known after apply)
      + name   = "reader"
      + policy = <<-EOT
            # Read-only permission on secrets
            path "secret/*" {
              capabilities = ["read", "list"]
            }
            # List enabled secrets engines
            path "sys/mounts" {
              capabilities = ["read", "list"]
            }
            # Required for Vault UI
            path "sys/internal/ui/mounts/*" {
              capabilities = ["read"]
            }
            # Allow reading own token info
            path "auth/token/lookup-self" {
              capabilities = ["read"]
            }
            # Allow reading OIDC auth config (for OIDC login flow)
            path "auth/oidc/role/*" {
              capabilities = ["read"]
            }
        EOT
    }

Plan: 15 to add, 2 to change, 0 to destroy.

Changes to Outputs:
  ~ portal_auth_url                = (sensitive value)
  ~ portal_sso_gate_enabled        = (sensitive value)
╷
│ Error: Get "https://sso.zitian.partyadmin/GitHub": dial tcp: lookup sso.zitian.partyadmin on 10.43.0.10:53: no such host
│ 
│ 
╵

```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`